app/controllers/users_controller.rb

UPDATE "users" SET "confirmation_sent_at" = ?, "confirmation_token" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["confirmation_sent_at", "2015-02-11 00:39:25.284128"], ["confirmation_token", "721766ca336e1dd059f5d0728807d9e8be5e8784f20f6cd75be17bf71f2f1d42"], ["updated_at", "2015-02-11 00:39:25.283254"]]
---
  def finish_signup
    if request.patch? && params[:user]
      if @user.update(user_params)